[
  {
    "listing": "/index.html",
    "items": [
      "/posts/Yogiji asked a devotee, \"When do we have darshan of Lord Krishna?\" .html",
      "/posts/Conversations on Shri Aurobindho's experience and how he started seeing everything as Krishna leela after the divine experience..html",
      "/posts/Bhagwan on His special regard for India.html",
      "/posts/Bhagwan sharing puffed rice with crow and dogs..html",
      "/posts/Bhagwan in the streets of Thiruvannamalai .html",
      "/posts/Yogiji remebered what JK said about assasination of Indira Gandhi. And A Mahatma with green turban and hand fan protecting her.html",
      "/posts/Bhagwan says don't let your mind be empty. Fill all empty time with Naama, prayer and Puja, then no repulsive thoughts would come.html",
      "/posts/Yogi Ramsuratkumar on Gandhi Jayanthi day about Gandhiji.html",
      "/posts/Mendicant getting food by Bhagavan's blessings..html",
      "/posts/How a youth from Madras became rich with his blessings?.html",
      "/posts/Writer Indumathi's request to Bhagavan Yogi Ramsuratkumar.html",
      "/posts/Story of a King who became alwar.html",
      "/posts/Meenakshi Patti's experience and vision of Rama and Lakshmana.html",
      "/posts/Agaram Jayaraman's mistake and Bhagavan's leela on correcting it.html",
      "/posts/Bhagavan Yogi Ramsuratkumar on holy places.html",
      "/posts/Miraculous medical cure of Isswarya Kumaravel knee cancer.html",
      "/posts/Mataji Devaki Ma's reply.html",
      "/posts/How Bhagavan Yogi Ramsuratkumar reinforced Hargopal's faith on Pagalnath?.html",
      "/posts/A devotee's answer to \"Have you seen my Father?\".html",
      "/posts/Why Bhagavan Yodi Ramsuratkumar called himself as a beggar?.html",
      "/posts/Bhagavan Yogi Ramsuratkumar's advice to Justice Arunachalam on how to do seva.html",
      "/posts/Bhagavan Yogi ramsuratkumar's teachings on being active and offering everything to God..html",
      "/posts/Jayaraman's cobweb experience with Bhagavan in Sannadhi street house.html",
      "/posts/Don't judge what is inside from what is outside.html",
      "/posts/Bhagavan on India.html",
      "/posts/Bhagwan says we must stay focused on our Guru Seva and not get distracted by criticism or humiliation from others.html",
      "/posts/Bhagwan talks about Seva to Guru and Guru is the Triveni Sangam.html",
      "/posts/Bhagavan says do your sadhana from wherever you are .html",
      "/posts/\"If you think this begger is Rama he will come as Rama and if you think is begger is Shiva....html",
      "/posts/Bhagwan says \"We are the puppets in the the hands of the supreme power\".html",
      "/posts/Devotees in Sannidhi street get blessed with a holy dip in the Kumbakonam tank with the sprinkling of water from His coconut shell. .html",
      "/posts/Bhagavan says he has studied only Ram nam.html",
      "/posts/Ma had to come back to the house in 7 min from temple and the Baby holds on the Bhagwan's thumb.html",
      "/posts/Ramdas presenting prasad as offering to Bhagavan.html",
      "/posts/Utsava Murthies halt before Bhagwan's Sannidhi Street House.html",
      "/posts/Add  'Yogi Ramsuratkumar' nama also to Sandhya Vandanam.html",
      "/posts/Why we get blessings from saints on birthday?.html",
      "/posts/Will bumped into Bhagwan and He got angry and said -  When you are with this Beggar you must be very attentive, pay full attention to him.html",
      "/posts/Arunachaleshwara Temple Festival.html",
      "/posts/Smt. Hilda meets Yogi in Sannidhi street house.html",
      "/posts/Bhagavan Yogi Ramsuratkumar's abode .html",
      "/posts/Bhagavan on Arunachaleshwar to Shivachariar .html",
      "/posts/Bhagavan says worry and nama cannot exist together.html",
      "/posts/Chariot incident at Thiruvannamalai.html",
      "/posts/Bhagavan's solution for Deepam lamp lit on top of Arunachala.html",
      "/posts/Two german ladies asked - what should be our sadhana Bhagwan answered - This BEGGAR will do your sadhana. You are thinking about this Beggar, serving this Beggar in many ways That will do..html",
      "/posts/Kamala's thinks \"Has Bhagwan gone to Kailas?\".html",
      "/posts/Giriraj Ji's 60th birthday.html",
      "/posts/Nagalakshmi finding Bhagavan as her guru..html",
      "/posts/Shivachariar seeks Bhagwan's blessings .html",
      "/posts/Two german ladies asked :what should be our sadhana Bhagwan answered :This BEGGAR will do your sadhana. You are thinking about this Beggar, serving this Beggar in many ways That will do..html",
      "/posts/Arunachaleshwara Temple Tank.html",
      "/posts/Bhagwan Ignored Will and Jones in Tapovanam after Swami Gnanandha Giri's Samadhi..html",
      "/posts/Hundi box and Bhagavan's first contribution.html",
      "/posts/Sri Rajan had a fight with his sister and Bhagwan through evolution in Biology taught him how to raise above his sisters actions.html",
      "/posts/Bhagwan tells the story of 2 brothers who lent money from the other and the fights between them.html",
      "/posts/Question on Bhagavan Yogi Ramsuratkumar's age.html",
      "/posts/Letter from Bhagwan got a hole and Bhagwan was very upset and said  \"You people spoiled my father's work! \".html",
      "/posts/John Pierre's Nama chanting and how he was calm on hearing about his brother's death who had commited suicide due to psychosis..html",
      "/posts/Srinivasan's thought of dying and Bhagavan's blessings.html",
      "/posts/Angry Bhairagi and Bhagavan appearing as Kalabhairavar and Maha Vishnu.html",
      "/posts/Srinivasan's frequent visits to Thruvannamalai .html",
      "/posts/Bhairagi who lost his kamandalam and Bhagavan offering money to buy a kamandalam for Bairaghi.html",
      "/posts/Incident where Bhagavan asked to bring 4 chapathis and explained how everything about him was connected to cosmos..html",
      "/posts/How Bhagavan saved his Sannadhi street house neighbour?.html",
      "/posts/Ganesh anna and Bhagavan's leela with butter milk.html",
      "/posts/Pillars in the Sannathi street.html",
      "/posts/K.V. Vishwanathan's second daughter's marriage and Bhagavan performing a miracle very similar to Bharathwaja maharishi in Ramayana. .html",
      "/posts/Yogi Ramsuratkumar's involvement in building of memorial for Rajadurai nadar.html",
      "/posts/Vaishnavites at Sannidhi Street House.html",
      "/posts/Skylab will not fall on Chennai .html",
      "/posts/Do you know the Sun up there in the sky, does it build hospitals orphanages or schools, does it have to talk to people to solve their problems but because of its shine the entire world and all its activities take place. A Yogi is like that Sun\".html",
      "/posts/Upma served to many people, Bhagwan had spoilt sambar, gave cashews to the devotee and ate the chillies. Gave very limited flowers to lots of devotees..html",
      "/posts/Ma Devaki on mother's day. A beggar woman's prayers for her son's wedding despite being chased away by all of her sons. .html",
      "/posts/Alwar was not allowed inside to meet Bhagwan and this broke his pride.html",
      "/posts/ Bhagwan asked why people were reading Ramayana and Bhagavata?.html",
      "/posts/Bhagwan asked devotee to go to the anatomy section and ask him about harmony in human body.html",
      "/posts/One of the devotees asked Bhagwan what is sin and what is a meritorius deed..html",
      "/posts/Bhagwan's solution to outbreak of cholera in Thiruvannamalai.html",
      "/posts/Bhagwan scolds Shri.Durairaj's driver of stealing and tells him to buy lottery ticket and blesses him.html",
      "/posts/Jayalakshmi's scary dreams and how Bhagavan helped her to get rid of them. .html",
      "/posts/many patients come to this begger here. But there is no hospital here My Father has given a new medicine to the world,.html",
      "/posts/The naxalite says to Bhagwan there will be a 3rd world war. He saw Bhagwan grew bigger in size and saw planets hanging in the sky like fruits from a tree and Bhagwan said- THere will be no 3rd world war.html",
      "/posts/Bhagwan then smiled and said that it was not the butter milk that they thought was the remedy. By now they knew it was His grace acting through it.html",
      "/posts/What have you studied Bhagwan?.html",
      "/posts/A young man asked Bhagwan what Peace of Mind was.html",
      "/posts/Bhagwan asking a lady professor - you are staying in Thiruvannamalai for 11 years but you came to see this beggar only three times?.html",
      "/posts/The moment they said 'Yes' Bhagwan flared up saying Jiddu Krishnamurthy was a great saint and elaborated on his great works.html",
      "/posts/Bhagwan listens to the problems and says \"So what?\".html",
      "/posts/Bhagwan gave lots of incense sticks to Smt. Manorama Devi and Mathaji Ram Ranjani Devi also wanted lots of incense sticks.html",
      "/posts/Raman and his brother is hungry but Bhagwan has allthe idlies..html",
      "/posts/The crows caws are music to Bhagwan's ears. Bhagwan's reactions to Ilayaraja's music and crow's caws..html",
      "/posts/Bhagwan strongly refuted him saying Pandian had been coming for Car Darshan exactly 37 times.  .html",
      "/posts/Arunachaleshwara has no ears but hears, has no hands but is working all the time..html",
      "/posts/Bhagwan says 'thambi you cannot stay here, this is no lodge, you go and come later ' .html",
      "/posts/Once a visitor asked Bhagwan what was Dharma and what was Adharma.html",
      "/posts/Muslim gets called from the long queue and Bhagwan blesses him.html",
      "/posts/Meeting of two smugglars with Bhagwan.html",
      "/posts/Bhagwan says His father was never wrong and would never be partial to any one...html",
      "/posts/Story of Gangappa was narrated by Bhagwan who was the collector of North Arcot . How he performed the Kumbabhishekam of Tanjavur temple.html"
    ]
  }
]