[
  {
    "listing": "/index.html",
    "items": [
      "/posts/Meenakshi Patti's experience and vision of Rama and Lakshmana.html",
      "/posts/Agaram Jayaraman's mistake and Bhagavan's leela on correcting it.html",
      "/posts/Miraculous medical cure of Isswarya Kumaravel knee cancer.html",
      "/posts/Mataji Devaki Ma's reply.html",
      "/posts/Bhagwan says \"We are the puppets in the the hands of the supreme power\".html",
      "/posts/Devotees in Sannidhi street get blessed with a holy dip in the Kumbakonam tank with the sprinkling of water from His coconut shell. .html",
      "/posts/Ma had to come back to the house in 7 min from temple and the Baby holds on the Bhagwan's thumb.html",
      "/posts/Ramdas presenting prasad as offering to Bhagavan.html",
      "/posts/Utsava Murthies halt before Bhagwan's Sannidhi Street House.html",
      "/posts/Arunachaleshwara Temple Festival.html",
      "/posts/Smt. Hilda meets Yogi in Sannidhi street house.html",
      "/posts/Chariot incident at Thiruvannamalai.html",
      "/posts/Bhagavan's solution for Deepam lamp lit on top of Arunachala.html",
      "/posts/Giriraj Ji's 60th birthday.html",
      "/posts/Shivachariar seeks Bhagwan's blessings .html",
      "/posts/Arunachaleshwara Temple Tank.html",
      "/posts/Hundi box and Bhagavan's first contribution.html",
      "/posts/Sri Rajan had a fight with his sister and Bhagwan through evolution in Biology taught him how to raise above his sisters actions.html",
      "/posts/Bhagwan tells the story of 2 brothers who lent money from the other and the fights between them.html",
      "/posts/John Pierre's Nama chanting and how he was calm on hearing about his brother's death who had commited suicide due to psychosis..html",
      "/posts/Srinivasan's thought of dying and Bhagavan's blessings.html",
      "/posts/Angry Bhairagi and Bhagavan appearing as Kalabhairavar and Maha Vishnu.html",
      "/posts/Srinivasan's frequent visits to Thruvannamalai .html",
      "/posts/Bhairagi who lost his kamandalam and Bhagavan offering money to buy a kamandalam for Bairaghi.html",
      "/posts/Incident where Bhagavan asked to bring 4 chapathis and explained how everything about him was connected to cosmos..html",
      "/posts/How Bhagavan saved his Sannadhi street house neighbour?.html",
      "/posts/Ganesh anna and Bhagavan's leela with butter milk.html",
      "/posts/Pillars in the Sannathi street.html",
      "/posts/K.V. Vishwanathan's second daughter's marriage and Bhagavan performing a miracle very similar to Bharathwaja maharishi in Ramayana. .html",
      "/posts/Yogi Ramsuratkumar's involvement in building of memorial for Rajadurai nadar.html",
      "/posts/Vaishnavites at Sannidhi Street House.html",
      "/posts/Upma served to many people, Bhagwan had spoilt sambar, gave cashews to the devotee and ate the chillies. Gave very limited flowers to lots of devotees..html",
      "/posts/Ma Devaki on mother's day. A beggar woman's prayers for her son's wedding despite being chased away by all of her sons. .html",
      "/posts/Alwar was not allowed inside to meet Bhagwan and this broke his pride.html",
      "/posts/Bhagwan's solution to outbreak of cholera in Thiruvannamalai.html",
      "/posts/Bhagwan scolds Shri.Durairaj's driver of stealing and tells him to buy lottery ticket and blesses him.html",
      "/posts/Jayalakshmi's scary dreams and how Bhagavan helped her to get rid of them. .html",
      "/posts/What have you studied Bhagwan?.html",
      "/posts/The moment they said 'Yes' Bhagwan flared up saying Jiddu Krishnamurthy was a great saint and elaborated on his great works.html",
      "/posts/Bhagwan gave lots of incense sticks to Smt. Manorama Devi and Mathaji Ram Ranjani Devi also wanted lots of incense sticks.html",
      "/posts/Raman and his brother is hungry but Bhagwan has allthe idlies..html",
      "/posts/Bhagwan says 'thambi you cannot stay here, this is no lodge, you go and come later ' .html",
      "/posts/Muslim gets called from the long queue and Bhagwan blesses him.html",
      "/posts/Meeting of two smugglars with Bhagwan.html"
    ]
  }
]